## Indexing pandas

### example dataset
![](pic/eggdata.png)

### 建立example data

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:

data = {
    'month': ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun'],
    'eggs': [47,110,221,77,132,205],
    'salt': [12.0, 50.0, 89.0, 87.0, np.NaN, 60.0],
    'spam': [17, 31, 72, 20, 52, 55]
}

In [23]:
df = pd.DataFrame(data)

In [26]:
df=df.set_index('month')

In [27]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [28]:
df['eggs']['Feb']

110

In [34]:
df.salt['Apr']

87.0

In [35]:
df.loc['Feb', 'eggs']

110

In [36]:
df.loc['Feb':'May', 'eggs']

month
Feb    110
Mar    221
Apr     77
May    132
Name: eggs, dtype: int64

In [37]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [39]:
df.iloc[1,1]

50.0

In [40]:
df[['eggs','salt']]

       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0
May     132   NaN
Jun     205  60.0

In [43]:
df['eggs']

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

In [44]:
df['eggs'][1:4]

month
Feb    110
Mar    221
Apr     77
Name: eggs, dtype: int64

In [45]:
df['eggs'][4]

132

In [46]:
df.loc[:, 'eggs':'salt']

       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0
May     132   NaN
Jun     205  60.0

In [49]:
df.iloc[2:5, 2:]

       spam
month
Mar      72
Apr      20
May      52

In [52]:
df.iloc[[1, 3, 5], [1,2]]

       salt  spam
month
Feb    50.0    31
Apr    87.0    20
Jun    60.0    55

In [53]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [57]:
df.iloc[[1, 3, 5], [0, 2]]

       eggs  spam
month
Feb     110    31
Apr      77    20
Jun     205    55

In [58]:
df['eggs']

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

In [59]:
type(df['eggs'])

pandas.core.series.Series

In [ ]:
df